Architecture MD update
